driver-tests/sapbc/SAPBCTests/SAPBCJbi/test/TestCaseGenericIDocOut/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" 
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
  xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
  xmlns:ech="http://j2ee.netbeans.org/wsdl/echoGenericIDoc4x">
  <soapenv:Body>
    <ech:IdocInboundAsynchronous>
      <IdocControlRec40>
        <!--Zero or more repetitions:-->
        <item>
          <Tabnam>EDIDC40</Tabnam>
          <Mandt>800</Mandt>
          <Docnum>0000000099224073</Docnum>
          <Docrel>640</Docrel>
          <Status></Status>
          <Direct>2</Direct>
          <Outmod></Outmod>
          <Exprss></Exprss>
          <Test></Test>
          <Idoctyp>CREMAS04</Idoctyp>
          <Cimtyp></Cimtyp>
          <Mestyp>CREMAS</Mestyp>
          <Mescod></Mescod>
          <Mesfct></Mesfct>
          <Std></Std>
          <Stdvrs></Stdvrs>
          <Stdmes></Stdmes>
          <Sndpor>SAPEUC</Sndpor>
          <Sndprt>LS</Sndprt>
          <Sndpfc></Sndpfc>
          <Sndprn>LSYS800</Sndprn>
          <Sndsad></Sndsad>
          <Sndlad></Sndlad>
          <Rcvpor>SAPEUC</Rcvpor>
          <Rcvprt>LS</Rcvprt>
          <Rcvpfc></Rcvpfc>
          <Rcvprn>ZSBYN_JK</Rcvprn>
          <Rcvsad></Rcvsad>
          <Rcvlad></Rcvlad>
          <Credat>20061207</Credat>
          <Cretim>073712</Cretim>
          <Refint></Refint>
          <Refgrp></Refgrp>
          <Refmes></Refmes>
          <Arckey></Arckey>
          <Serial></Serial>
        </item>
      </IdocControlRec40>
      <IdocDataRec40>
        <!--Zero or more repetitions:-->
        <item>
          <Segnam>E2LFA1M</Segnam>
          <Mandt>800</Mandt>
          <Docnum>0000000099224073</Docnum>
          <Segnum>000001</Segnum>
          <Psgnum>000000</Psgnum>
          <Hlevel>01</Hlevel>
          <Sdata>005OFFD      Company                                 000000000000        0                 20060316PS1                              0001          US            Office Depot                       Office Supply Store for JBI                                                                              Mon                                                                                       91016        OFFD        E                             555 Royal Oaks Drive                                                                                                                                                                                                  0000022335OFFICE DEPOT             OFFICE SUPPLY STORE      MON                                               00000000            00000000                                               XX  X                                                                                  0                                                                    </Sdata>
        </item>
        <item>
          <Segnam>E2LFA1A</Segnam>
          <Mandt>800</Mandt>
          <Docnum>0000000099224073</Docnum>
          <Segnum>000002</Segnum>
          <Psgnum>000001</Psgnum>
          <Hlevel>02</Hlevel>
          <Sdata>                                                                                                                                                                                                          00000000                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      </Sdata>
        </item>
        <item>
          <Segnam>E2LFM1M</Segnam>
          <Mandt>800</Mandt>
          <Docnum>0000000099224073</Docnum>
          <Segnum>000003</Segnum>
          <Psgnum>000001</Psgnum>
          <Hlevel>02</Hlevel>
          <Sdata>005OFFD      0001  20060316PS1            USD                                                0            0001                                                  0                                    0.0                              0                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 </Sdata>
        </item>
        <item>
          <Segnam>E2WYT3M</Segnam>
          <Mandt>800</Mandt>
          <Docnum>0000000099224073</Docnum>
          <Segnum>000004</Segnum>
          <Psgnum>000003</Psgnum>
          <Hlevel>03</Hlevel>
          <Sdata>005OFFD      0001              BA000PS1         20060316OFFD       00000000                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                             </Sdata>
        </item>
        <item>
          <Segnam>E2WYT3M</Segnam>
          <Mandt>800</Mandt>
          <Docnum>0000000099224073</Docnum>
          <Segnum>000005</Segnum>
          <Psgnum>000003</Psgnum>
          <Hlevel>03</Hlevel>
          <Sdata>005OFFD      0001              LF000PS1         20060316OFFD       00000000                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                             </Sdata>
        </item>
        <item>
          <Segnam>E2WYT3M</Segnam>
          <Mandt>800</Mandt>
          <Docnum>0000000099224073</Docnum>
          <Segnum>000006</Segnum>
          <Psgnum>000003</Psgnum>
          <Hlevel>03</Hlevel>
          <Sdata>005OFFD      0001              RS000PS1         20060316OFFD       00000000                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                             </Sdata>
        </item>
      </IdocDataRec40>
    </ech:IdocInboundAsynchronous>
  </soapenv:Body>
</soapenv:Envelope>